The  IFCImportOptions  type exposes the following members.
 Constructors
Name  |   Description
IFCImportOptions
 Constructs a new IFCImportOptions using default settings.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  IFCImportOptions
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetConversionData
 Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
Action
 The action of the import.
AutoJoin
 Enable or disable auto-join at the end of import.
CreateLinkInstanceOnly
 Determines whether to create a linked symbol element or not.
ForceImport
 Force the IFC file to be imported regardless of an existing corresponding Revit file.
Intent
 The intent of the import.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RevitLinkFileName
 The full path of the intermediate Revit file created during a previous link action. This is used during "Reload From" to determine the path to the previous generated Revit file.
 See Also
  IFCImportOptions Class
  Autodesk.Revit.DB.IFC Namespace